#include <iostream>
using namespace std;
int main() 
{
      setlocale(LC_ALL, ".65001");
    int n, m, a; // объявляем целочисленные переменные n, m, a 
    bool b, c; // объявляем переменные типа bool b и c
    cout << "Введите значения переменных " << endl; // выводим для пользователя сообщение
    cout << "n = "; // выводим для пользователя сообщение
    cin >> n; //пользователь вводит значение для n
    cout << "m = "; // выводим для пользователя сообщение
    cin >> m; //пользователь вводит значение для m
    a = n++-m;// выполняем действие, нахолим a по формуле n (затем увеличиваем знаечние на единицу) минус m
    cout << "Результаты " << endl; // вывоодим результат
    cout << "n++-m = " << a << endl; // выводим результат
    cout << boolalpha; // выводим вместо 0 и 1 true или false
    b = m-- >n; // сравниваем m (затем уменьшаем на 1) с новым n
    cout << "m-- >n = " << b << endl; // выводим результат
    c = n-- >m; // сравниваем новый n (затем уменьшаем его на 1) с новым m
    cout << "n-- >m = " << c << endl; // выводим результат
return 0;
}