#include <iostream>
#include <cmath>
using namespace std;
int main() {
      setlocale(LC_ALL, ".65001");
    double a = 100, b = 0.001; // инициализируем переменные a и b типа double
    double c, e, d, f, g, h, i, result; // объявляем переменные для промежуточных результатов и финального результата
    c = pow(a-b, 4); // задаем значение промежуточной переменной с
    cout << "1. (a-b)^4 = " << c << endl; // выводим промежуточный результат
    d = pow(a, 4); // задаем значение промежуточной переменной d
    h = pow(a, 3); // задаем значение промежуточной переменной h
    e = 4*h*b; // задаем значение промежуточной переменной e
    f = 6*a*a*b*b; // задаем значение промежуточной переменной f
    cout << "2. (a^4 - 4a^3b + 6a^2b^2) = " << (d-e+f) << endl; // выводим промежуточный результат
    cout << "3. (a-b)^4 - (a^4 - 4a^3b + 6a^2b^2) = " << c-(d-e+f) << endl; // выводим промежуточный результат
    g = pow(b, 4); // задаем значение промежуточной переменной g
    i = 4*a*b*b*b; // задаем значение промежуточной переменной i
    cout << "4. b^4 - 4ab^3 = " << g-i << endl; // выводим промежуточный результат
    result = (c-(d-e+f))/(g-i); // находим результат вычисления
    cout << "Результат вычисления для переменных типа double" << endl; // выводим результат
    cout << "  (a-b)^4 - (a^4 - 4a^3b + 6a^2b^2)" << endl;
    cout << "  ------------------------------        = " << result << endl;
    cout << "           b^4 - 4ab^3" << endl;
return 0;
}
